Tekla Open API Reference for Tekla Structures 2025
Beam.EndPointOffset Property
 Gets or sets the beam's end point offset.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Offset EndPointOffset { get; set; }
Public Property EndPointOffset As Offset
	Get
	Set
Property Value
Type: Offset
See Also
Reference
Beam Class
Tekla.Structures.Model Namespace